#include "WinMain.h"
#include "HpBar.h"

// =====================================================
//	グローバル変数
//	複数の関数で共通して使いたい変数はここに書く
// =====================================================
static HpBar hp_bar (WINDOW_W/2, WINDOW_H / 2,200,20);

// =====================================================
//		初期化
//	ゲーム開始直後に最初に1回だけ実行される関数
//	最初の値を変数に入れたいときに使う
// =====================================================
void GameInit()
{
	hp_bar.init();
}
// =====================================================
//		更新
//	ゲームが終了されるまで実行される関数
//	1秒間に約60回呼ばれる
//	1フレームで行う処理をここに書く
// =====================================================
void GameUpdate()
{
	hp_bar.update();
	if (IsKeyOn(KEY_INPUT_SPACE))
	{
		//hp_bar.damage(20);
		hp_bar -= 10;
	}

	if (hp_bar<=0)
	{
		//hp_bar.reset();
	}
}
// =====================================================
//		描画
//	ゲームが終了されるまで実行される関数
//	1秒間に約60回呼ばれる
//	GameUpdate関数が実行された後に実行される関数
// =====================================================
void GameDraw()
{
	printfDx("hp : %d\n", hp_bar.hp_);
	printfDx("hp green : %d\n", hp_bar.green_pos_x2);
	hp_bar.render();
}
// =====================================================
//		終了
//	ゲームが終了する前に1回だけ実行される関数
//	何か最後に後片付けを行うときに使う
// =====================================================
void GameExit()
{
	hp_bar.exit();

}
