#pragma once
// ------------------------------------------------------
//	すべての共通ファイル
// ------------------------------------------------------
// =========================================
//		構造体
// =========================================
// 座標
struct Pos
{
	float x = 0;
	float y = 0;
};

// =========================================
//	列挙体
// =========================================
// 向き
enum DIR
{
	DOWN = 0,
	LEFT, RIGHT,
	UP,
};
// シーン
enum SCENE
{
	TITLE = 0,	// タイトル
	CREDIT,		// クレジット
	GAME_MAIN,	// ゲームメイン

	SCENE_MAX
};
// フォント種別
enum FONT
{
	PIXEL_M = 0,	// PixelMplus10
	TYPE_MAX
};