#include "WinMain.h"
#include "ActorBase.h"
#include "ActorDog.h"
// -----------------------------------------------------
//	犬クラス（ソースファイル）
//	 キー入力で移動するキャラクタークラス
// -----------------------------------------------------
// =====================================================
//	アニメーション画像を付ける
//	 引数は画像ファイル名にする
//	 画像の読み込みに失敗したときはfalseを返す
// =====================================================

// =====================================================
//	アニメーション再生処理
// =====================================================

// =====================================================
//	座標を画面外に出ないようにする処理
// =====================================================
void ActorDog::posReset()
{
	if (pos_.x < 0 + IMG_SIZE / 2)
	{
		pos_.x = 0 + IMG_SIZE / 2;
	}
	if (pos_.x > WINDOW_W / 3 * 1 - IMG_SIZE / 2)
	{
		pos_.x = WINDOW_W / 3 * 1 - IMG_SIZE / 2;
	}
	if (pos_.y < 0)
	{
		pos_.y = 0;
	}
	if (pos_.y > WINDOW_H - IMG_SIZE)
	{
		pos_.y = WINDOW_H - IMG_SIZE;
	}
}
// =====================================================
//	初期化処理
// =====================================================
void ActorDog::init() 
{
	attachImage("data/animation/pipo-charachip009b.png");
	pos_ = { WINDOW_W / 3 * 0 + (WINDOW_W / 3 / 2), WINDOW_H / 2 };
}
// =====================================================
//	更新処理
// =====================================================
void ActorDog::update()
{
	playAnimation();

	// キー操作での移動
	if (IsKeyRepeat(KEY_INPUT_LEFT))
	{
		--pos_.x;
		dir_ = DIR::LEFT;
	}
	else if (IsKeyRepeat(KEY_INPUT_RIGHT))
	{
		++pos_.x;
		dir_ = DIR::RIGHT;
	}
	else if (IsKeyRepeat(KEY_INPUT_DOWN))
	{
		++pos_.y;
		dir_ = DIR::DOWN;
	}
	else if (IsKeyRepeat(KEY_INPUT_UP))
	{
		--pos_.y;
		dir_ = DIR::UP;
	}

	posReset();
}
// =====================================================
//	描画処理
// =====================================================

// =====================================================
//	終了処理
// =====================================================
