#include "WinMain.h"
#include "ShapeBase.h"
#include "Circle.h"
#include "Box.h"

// =====================================================
//	グローバル変数
//	複数の関数で共通して使いたい変数はここに書く
// =====================================================
namespace
{
	// *********************************************
	//	ここから編集禁止
	Circle circle;
	Box	   box;

	// 図形クラスの更新処理をする関数
	void ShapeUpdate(ShapeBase& obj)
	{
		obj.update();
	}
	//	ここまで編集禁止
	// *********************************************

}

// =====================================================
//		初期化
//	ゲーム開始直後に最初に1回だけ実行される関数
//	最初の値を変数に入れたいときに使う
// =====================================================
void GameInit()
{
	circle.init();
	box.init();
	box._circlepos_ptr = circle.getPos();
}
// *********************************************
//	ここから編集禁止
// =====================================================
//		更新
//	ゲームが終了されるまで実行される関数
//	1秒間に約60回呼ばれる
//	1フレームで行う処理をここに書く
// =====================================================
void GameUpdate()
{
	ShapeUpdate(circle);
	ShapeUpdate(box);
}
//	ここまで編集禁止
// *********************************************
// *********************************************
//	ここから編集禁止
// =====================================================
//		描画
//	ゲームが終了されるまで実行される関数
//	1秒間に約60回呼ばれる
//	GameUpdate関数が実行された後に実行される関数
// =====================================================
void GameDraw()
{
	circle.render();
	box.render();
}
//	ここまで編集禁止
// *********************************************
// =====================================================
//		終了
//	ゲームが終了する前に1回だけ実行される関数
//	何か最後に後片付けを行うときに使う
// =====================================================
void GameExit()
{

}
