#include "WinMain.h"
#include "Circle.h"

// =====================================================
//	グローバル変数
//	複数の関数で共通して使いたい変数はここに書く
// =====================================================
const int CIRCLE_NUM = 10;
Circle circle[CIRCLE_NUM];

// =====================================================
//		初期化
//	ゲーム開始直後に最初に1回だけ実行される関数
//	最初の値を変数に入れたいときに使う
// =====================================================
void GameInit()
{

	

}
// =====================================================
//		更新
//	ゲームが終了されるまで実行される関数
//	1秒間に約60回呼ばれる
//	1フレームで行う処理をここに書く
// =====================================================
void GameUpdate()
{

	for (int i = 0; i < CIRCLE_NUM; i++)
	{
		
		if (IsKeyOn(KEY_INPUT_SPACE))
		{
			if (circle[i].isSpawn())
			{
				continue;
			}
			circle[i].spawn();
			break;
		}
	}
	for (int i = 0; i < CIRCLE_NUM; i++)
	{
		circle[i].update();
	}

}
// =====================================================
//		描画
//	ゲームが終了されるまで実行される関数
//	1秒間に約60回呼ばれる
//	GameUpdate関数が実行された後に実行される関数
// =====================================================
void GameDraw()
{
	for (int i = 0; i < CIRCLE_NUM; i++)
	{
		circle[i].render();
	}

	//clsDx();
	circle[0].debuglog();
	

}
// =====================================================
//		終了
//	ゲームが終了する前に1回だけ実行される関数
//	何か最後に後片付けを行うときに使う
// =====================================================
void GameExit()
{


}
